esp-rs/esp-pacs/esp32s3-ulp/svd/esp32s3-ulp.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SENS</name>
      <description>SENS Peripheral</description>
      <groupName>SENS</groupName>
      <baseAddress>0x0000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x11C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TOUCH_DONE_INT</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_INACTIVE_INT</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_ACTIVE_INT</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>SARADC1_DONE_INT</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>SARADC2_DONE_INT</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TSENS_DONE_INT</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_TIME_OUT_INT</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_APPROACH_LOOP_DONE_INT</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_SCAN_DONE_INT</name>
        <value>11</value>
      </interrupt>
      <registers>
        <register>
          <name>SAR_READER1_CTRL</name>
          <description>configure saradc1 reader</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x20040002</resetValue>
          <fields>
            <field>
              <name>SAR_SAR1_CLK_DIV</name>
              <description>clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR1_CLK_GATED</name>
              <description>no public</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR1_SAMPLE_NUM</name>
              <description>no public</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR1_DATA_INV</name>
              <description>Invert SAR ADC1 data</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR1_INT_EN</name>
              <description>enable saradc1 to send out interrupt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_READER1_STATUS</name>
          <description>get saradc1 reader controller status</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_SAR1_READER_STATUS</name>
              <description>get saradc1 reader controller status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS1_CTRL1</name>
          <description>no public</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_FORCE_XPD_AMP</name>
              <description>no public</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_RST_FB_FORCE</name>
              <description>no public</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_SHORT_REF_FORCE</name>
              <description>no public</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_SHORT_REF_GND_FORCE</name>
              <description>no public</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS1_CTRL2</name>
          <description>configure saradc1 controller</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_MEAS1_DATA_SAR</name>
              <description>SAR ADC1 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_MEAS1_DONE_SAR</name>
              <description>SAR ADC1 conversion done indication</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_MEAS1_START_SAR</name>
              <description>SAR ADC1 controller (in RTC) starts conversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_MEAS1_START_FORCE</name>
              <description>1: SAR ADC1 controller (in RTC) is started by SW</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR1_EN_PAD</name>
              <description>SAR ADC1 pad enable bitmap</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR1_EN_PAD_FORCE</name>
              <description>1: SAR ADC1 pad enable bitmap is controlled by SW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS1_MUX</name>
          <description>configure saradc1 controller</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_SAR1_DIG_FORCE</name>
              <description>1: SAR ADC1 controlled by DIG ADC1 CTRL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_ATTEN1</name>
          <description>configure saradc1 controller</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SAR_SAR1_ATTEN</name>
              <description>2-bit attenuation for each pad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_AMP_CTRL1</name>
          <description>no public</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x000A000A</resetValue>
          <fields>
            <field>
              <name>SAR_AMP_WAIT1</name>
              <description>no public</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_WAIT2</name>
              <description>no public</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_AMP_CTRL2</name>
          <description>no public</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x000A0000</resetValue>
          <fields>
            <field>
              <name>SAR_SAR1_DAC_XPD_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_XPD_SAR_AMP_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_RST_FB_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_SHORT_REF_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_SHORT_REF_GND_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_XPD_SAR_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_RSTB_FSM_IDLE</name>
              <description>no public</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_WAIT3</name>
              <description>no public</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_AMP_CTRL3</name>
          <description>no public</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x007338F3</resetValue>
          <fields>
            <field>
              <name>SAR_SAR1_DAC_XPD_FSM</name>
              <description>no public</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_XPD_SAR_AMP_FSM</name>
              <description>no public</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_RST_FB_FSM</name>
              <description>no public</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_SHORT_REF_FSM</name>
              <description>no public</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_AMP_SHORT_REF_GND_FSM</name>
              <description>no public</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_XPD_SAR_FSM</name>
              <description>no public</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_RSTB_FSM</name>
              <description>no public</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_READER2_CTRL</name>
          <description>configure saradc2 reader</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x40050002</resetValue>
          <fields>
            <field>
              <name>SAR_SAR2_CLK_DIV</name>
              <description>clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_WAIT_ARB_CYCLE</name>
              <description>wait arbit stable after sar_done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_CLK_GATED</name>
              <description>******* Description ***********</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_SAMPLE_NUM</name>
              <description>******* Description ***********</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_DATA_INV</name>
              <description>Invert SAR ADC2 data</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_INT_EN</name>
              <description>enable saradc2 to send out interrupt</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_READER2_STATUS</name>
          <description>get saradc1 reader controller status</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_SAR2_READER_STATUS</name>
              <description>get saradc1 reader controller status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS2_CTRL1</name>
          <description>configure saradc2 controller</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x07020200</resetValue>
          <fields>
            <field>
              <name>SAR_SAR2_CNTL_STATE</name>
              <description>saradc2_cntl_fsm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_SAR2_PWDET_CAL_EN</name>
              <description>rtc control pwdet enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_PKDET_CAL_EN</name>
              <description>rtc control pkdet enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_EN_TEST</name>
              <description>SAR2_EN_TEST</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_RSTB_FORCE</name>
              <description>no public</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_STANDBY_WAIT</name>
              <description>no public</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_RSTB_WAIT</name>
              <description>no public</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_XPD_WAIT</name>
              <description>no public</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS2_CTRL2</name>
          <description>configure saradc2 controller</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_MEAS2_DATA_SAR</name>
              <description>SAR ADC2 data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_MEAS2_DONE_SAR</name>
              <description>SAR ADC2 conversion done indication</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_MEAS2_START_SAR</name>
              <description>SAR ADC2 controller (in RTC) starts conversion</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_MEAS2_START_FORCE</name>
              <description>1: SAR ADC2 controller (in RTC) is started by SW</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_EN_PAD</name>
              <description>SAR ADC2 pad enable bitmap</description>
              <bitOffset>19</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_EN_PAD_FORCE</name>
              <description>1: SAR ADC2 pad enable bitmap is controlled by SW</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_MEAS2_MUX</name>
          <description>configure saradc2 controller</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_SAR2_PWDET_CCT</name>
              <description>SAR2_PWDET_CCT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SAR2_RTC_FORCE</name>
              <description>in sleep, force to use rtc to control ADC</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_ATTEN2</name>
          <description>configure saradc2 controller</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>SAR_SAR2_ATTEN</name>
              <description>2-bit attenuation for each pad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_POWER_XPD_SAR</name>
          <description>configure power of saradc</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_FORCE_XPD_SAR</name>
              <description>force power on/off saradc</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SARCLK_EN</name>
              <description>no public</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR1</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR1</name>
              <description>configure i2c slave address1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR0</name>
              <description>configure i2c slave address0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SARADC_MEAS_STATUS</name>
              <description>no public</description>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR2</name>
          <description>configure i2c slave address</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_SLAVE_ADDR3</name>
              <description>configure i2c slave address3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_SLAVE_ADDR2</name>
              <description>configure i2c slave address2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
